test/files/create_payment_request.json

{
  "Payments": [],
  "Key": "J68WM5JC2U",
  "Number": 2245,
  "TotalAmount": 102,
  "FromCurrency": {
    "Name": "CHF",
    "DisplayName": "Schweizerfranken",
    "Symbol": "CHF",
    "Code": "756",
    "IsCrypto": false,
    "Min": 0,
    "Max": 0,
    "Multiplier": 100
  },
  "ToCurrency": {
    "Name": "BTC",
    "DisplayName": "Bitcoin",
    "Symbol": "BTC",
    "Code": "BTC",
    "IsCrypto": true,
    "Min": 0,
    "Max": 0,
    "Multiplier": 100000000
  },
  "CustomerFee": 2,
  "PaymentRequestStateName": "Draft",
  "PaymentRequestStateEnumeration": "DRAFT",
  "OrderNumberRef": null,
  "Amount": 100,
  "TotalPaid": 0,
  "CurrencyCode": null,
  "CCAmount": 20063,
  "DiffCCAmount": 20063,
  "CryptoCurrencyAmount": 0,
  "CryptoCurrencyCode": null,
  "CryptoCurrencyAddress": "1P7c4Z6iiD3uUYnwVyH2BnCFAFovkNKSbj",
  "AuthorizedDate": null,
  "ExpirationDate": "/Date(1555079339407)/",
  "OrderDescription": "test description",
  "CapturedAmount": null,
  "CapturedDate": null,
  "Fee": null,
  "ModifiedOn": "/Date(-62135596800000)/",
  "ModifiedBy": null,
  "MD5HashKey": null,
  "TerminalNumber": null,
  "Email": null,
  "CallbackUrl": "https://staging-PaymentTerminal.bitcoinsuisse.ch/home/CheckForPayment",
  "AcceptUrl": null,
  "DeclineUrl": null,
  "LanguageCode": null,
  "CryptoExchangeRate": null,
  "PrimaryExchangeRate": {
    "Code": null,
    "ExchangeRate": 0.0001966911962501332,
    "Source": "Combined",
    "TimeStamp": "/Date(1555079019623)/",
    "FromCurrencyCode": null,
    "ToCurrencyCode": null,
    "FromCurrency": {
      "Name": "CHF",
      "DisplayName": "Schweizerfranken",
      "Symbol": "CHF",
      "Code": "756",
      "IsCrypto": false,
      "Min": 0,
      "Max": 0,
      "Multiplier": 100
    },
    "ToCurrency": {
      "Name": "BTC",
      "DisplayName": "Bitcoin",
      "Symbol": "BTC",
      "Code": "BTC",
      "IsCrypto": true,
      "Min": 0,
      "Max": 0,
      "Multiplier": 100000000
    }
  },
  "FeeExchangeRate": null,
  "QRData": "bitcoin:1P7c4Z6iiD3uUYnwVyH2BnCFAFovkNKSbj?amount=0.00020063&r=https%3a%2f%2ftest-paymentservices.bitcoinsuisse.ch%2fpay.aspx%3fpublicKey%3dREQUEST-1P7c4Z6iiD3uUYnwVyH2BnCFAFovkNKSbj"
}
