test/files/get_payment_request.json

{
  "Payments": [],
  "Key": "A952Y6K37Q",
  "Number": 2229,
  "TotalAmount": 0,
  "FromCurrency": {
    "Name": "CHF",
    "DisplayName": "Schweizerfranken",
    "Symbol": "CHF",
    "Code": "756",
    "IsCrypto": false,
    "Min": 0,
    "Max": 0,
    "Multiplier": 100
  },
  "ToCurrency": {
    "Name": "BTC",
    "DisplayName": "Bitcoin",
    "Symbol": "BTC",
    "Code": "BTC",
    "IsCrypto": true,
    "Min": 0,
    "Max": 0,
    "Multiplier": 100000000
  },
  "CustomerFee": 0,
  "PaymentRequestStateName": "Draft",
  "PaymentRequestStateEnumeration": "DRAFT",
  "OrderNumberRef": "test reference",
  "Amount": 100,
  "TotalPaid": 0,
  "CurrencyCode": "CHF",
  "CCAmount": 0,
  "DiffCCAmount": 0,
  "CryptoCurrencyAmount": 20251,
  "CryptoCurrencyCode": "BTC",
  "CryptoCurrencyAddress": "1JuA5VyLfnwgpBXN9DABWimMM8Qvg8V7gy",
  "AuthorizedDate": "/Date(1554973713043)/",
  "ExpirationDate": "/Date(1555060399957)/",
  "OrderDescription": "test description",
  "CapturedAmount": null,
  "CapturedDate": null,
  "Fee": 2,
  "ModifiedOn": "/Date(1554973712963)/",
  "ModifiedBy": "MerchantService",
  "MD5HashKey": "55c3a2265610f42f8d706298554c6354e34795557f39fe4fa5fba282d1a87fed",
  "TerminalNumber": "T53NF5",
  "Email": "cho@bitcoinsuisse.ch",
  "CallbackUrl": null,
  "AcceptUrl": null,
  "DeclineUrl": null,
  "LanguageCode": "en-US",
  "CryptoExchangeRate": null,
  "PrimaryExchangeRate": {
    "Code": null,
    "ExchangeRate": 0.0001985433,
    "Source": "Combined",
    "TimeStamp": "/Date(-62135596800000)/",
    "FromCurrencyCode": "CHF",
    "ToCurrencyCode": "BTC",
    "FromCurrency": null,
    "ToCurrency": null
  },
  "FeeExchangeRate": {
    "Code": null,
    "ExchangeRate": 0.0001985433,
    "Source": "Combined",
    "TimeStamp": "/Date(-62135596800000)/",
    "FromCurrencyCode": "CHF",
    "ToCurrencyCode": "BTC",
    "FromCurrency": null,
    "ToCurrency": null
  },
  "QRData": "bitcoin:1JuA5VyLfnwgpBXN9DABWimMM8Qvg8V7gy?amount=0.00000000&r=https%3a%2f%2ftest-paymentservices.bitcoinsuisse.ch%2fpay.aspx%3fpublicKey%3dREQUEST-1JuA5VyLfnwgpBXN9DABWimMM8Qvg8V7gy"
}
